#include <stdio.h>

/*
 * 2.	Да се реши систем од три равенки со три непознати.
 */

int main() {
    float a[3], b[3], c[3], d[3];
    double D, x, y, z;
    printf("Enter the values for a1, a2 ... d3\n"
                   "(a1)x + (b1)y + (c1)z + (d1) = 0\n(a2)x + (b2)y + (c2)z + (d2) = 0\n(a3)x + (b3)y + (c3)z + (d3) = 0\n");
    scanf("%f %f %f %f %f %f %f %f %f %f %f %f",
          &a[0], &b[0], &c[0], &d[0],
          &a[1], &b[1], &c[1], &d[1],
          &a[2], &b[2], &c[2], &d[2]);
    printf("%.2f*x + %.2f*y + %.2f*z + %.2f = 0\n", a[0], b[0], c[0], d[0]);
    printf("%.2f*x + %.2f*y + %.2f*z + %.2f = 0\n", a[1], b[1], c[1], d[1]);
    printf("%.2f*x + %.2f*y + %.2f*z + %.2f = 0\n", a[2], b[2], c[2], d[2]);

    D = (a[0] * b[1] * c[2] + b[0] * a[2] * c[1] + c[0] * a[1] * b[2]) -
        (a[0] * c[1] * b[2] + b[0] * a[1] * c[2] + c[0] * b[1] * a[2]);

    x = ((b[0] * c[2] * d[1] + c[0] * b[1] * d[2] + d[0] * c[1] * b[2]) -
         (b[0] * c[1] * d[2] + c[0] * b[2] * d[1] + d[0] * b[1] * c[2])) / D;
    y = ((a[0] * c[1] * d[2] + c[0] * a[2] * d[1] + d[0] * a[1] * c[2]) -
         (a[0] * c[2] * d[1] + c[0] * a[1] * d[2] + d[0] * c[1] * a[2])) / D;
    z = ((a[0] * b[2] * d[1] + b[0] * a[1] * d[2] + d[0] * b[1] * a[2]) -
         (a[0] * b[1] * d[2] + b[0] * a[2] * d[1] + d[0] * a[1] * b[2])) / D;

    printf("Solution is:\nx = %5.2f\ny = %5.2f\nz = %5.2f\n", x, y, z);

    return 0;
}