#include <stdio.h>
/*
 * Напиши програм кој  го дава следниот излез:
*****
*      *
*      *
*      *
*      *
*      *
*****
***
 *       *
*         *
*         *
*         *
 *      *
   ***
*
     ***
 *******
       *
       *
       *
       *	            *
          *  *
        *      *
      *          *
        *      *
          *  *
            *


 */
int main() {
    //a
    printf(        "*****\n"
                   "*\t*\n"
                   "*\t*\n"
                   "*\t*\n"
                   "*\t*\n"
                   "*\t*\n"
                   "*****\n\n");
    //b
    printf(        "  ***\n"
                   " *   *\n"
                   "*     *\n"
                   "*     *\n"
                   "*     *\n"
                   " *   *\n"
                   "  ***\n\n");
    //c
    printf(        "   *\n"
                   "  ***\n"
                   "*******\n"
                   "   *\n"
                   "   *\n"
                   "   *\n"
                   "   *\n\n");
    //d
    printf(        "   *\n"
                   "  * *\n"
                   " *   *\n"
                   "*     *\n"
                   " *   *\n"
                   "  * *\n"
                   "   *\n\n");
    return 0;
}